Repository: ututrc/vuosikello
Catalog: vuosikello/languages/päiväkoti-*.po
Languages: fi

source: Daycare center
fi: Päiväkoti

source: Add new
fi: Lisää uusi

source: Add new daycare
fi: Lisää uusi päiväkoti

source: New daycare
fi: Uusi päiväkoti

source: Edit daycare
fi: Muokkaa päiväkotia

source: View daycare
fi: Katsele päiväkotia

source: All daycares
fi: Kaikki päiväkodit

source: Find daycares
fi: Etsi päiväkoteja

source: Parent Daycare
fi: Yläkohde

source: Daycare not found.
fi: Päiväkotia ei löytynyt.

source: Daycare not found from trash.
fi: Päiväkotia ei löytynyt roskista.

source: Daycare archive
fi: Päiväkotiarkisto

source: Add into daycare
fi: Lisää päiväkotiin

source: Uploaded to this daycare
fi: Tähän päiväkotiin lisätyt

source: Filter daycare list
fi: Suodata listaa päiväkodeista

source: Daycare list navigation
fi: Navigoi listaa päiväkodeista

source: Daycare list
fi: Lista päiväkodeista
