Repository: ututrc/vuosikello
Catalog: vuosikello/languages/vuosikello-*.po
Languages: fi

source: Add new
fi: Lisää uusi

source: Vuosikello events
fi: Vuosikello tapahtumat

source: Vuosikello event
fi: Vuosikello tapahtuma

source: Add new vuosikello event
fi: Lisää uusi vuosikello tapahtuma

source: New vuosikello event
fi: Uusi vuosikello tapahtuma

source: Edit vuosikello event
fi: Muokkaa vuosikello tapahtumaa

source: View vuosikello event
fi: Tarkastele vuosikello tapahtumaa

source: All vuosikello events
fi: Kaikki vuosikello tapahtumat

source: Find vuosikello events
fi: Etsi vuosikello tapahtumia

source: Parent Vuosikello Events:
fi: Ylemmät vuosikello tapahtumat

source: Vuosikello events not found.
fi: Vuosikello tapahtumia ei löytynyt.

source: Vuosikello events not found from trash.
fi: Vuosikello tapahtumia ei löytynyt roskakorista.

source: Vuosikello events archive
fi: Vuosikello tapahtumien arkisto

source: Add into vuosikello event
fi: Lisää vuosikello tapahtumaan

source: Uploaded to this Vuosikello Event
fi: Lisätty tähän vuosikello tapahtumaan

source: Filter Vuosikello Events list
fi: Suodata vuosikello tapahtumien listaa

source: Vuosikello Events list navigation
fi: Vuosikello tapahtumien listan navigointi

source: Vuosikello Events list
fi: Vuosikello tapahtumien listaus

source: Vuosikello example option
fi: Vuosikello esimerkki vaihtoehto

source: General
fi: Yleiset

source: Vuosikello settings
fi: Vuosikello asetukset

source: Categories
fi: Kategoriat

source: Category
fi: Kategoria

source: Find categories
fi: Etsi kategorioita

source: Popular categories
fi: Suosittuja kategorioita

source: All categories
fi: Kaikki kategoriat

source: Edit category
fi: Muokkaa kategoriaa

source: Update category
fi: Päivitä kategoria

source: Add new category
fi: Lisää uusi kategoria

source: Add category name
fi: Lisää kategorian nimi

source: Separate categories with comma
fi: Erottele kategoriat pilkulla

source: Add or remove categories
fi: Lisää tai poista kategorioita

source: Choose from most used categories
fi: Valitse käytetyimmistä kategorioista

source: Event category
fi: Tapahtuman kategoria

source: Category 1
fi: Kategoria

source: Category 2
fi: Kategoria

source: Toggle text
fi: Tekstin vaihto päälle/pois

source: Event name:
fi: Tapahtuman nimi:

source: Event description:
fi: Tapahtuman kuvaus

source: Starts:
fi: Alkaa:

source: Ends:
fi: Loppuu:

source: Refresh
fi: Päivitä
